/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstdelone.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hmeriann <hmeriann@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/12 17:18:39 by hmeriann          #+#    #+#             */
/*   Updated: 2021/05/12 17:19:46 by hmeriann         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/* принимает элемент, память, выделенную под контента
которого нужно освободить, не трогает цепочку next*/

void	ft_lstdelone(t_list *lst, void (*del)(void *))
{
	if (NULL == lst)
		return ;
	if (del)
		del(lst -> content);
	free(lst);
}
